Revit 2027 API
SpatialElementTag.LeaderEnd Property
 The position of the leader's end.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ LeaderEnd { get; set; }
Public Property LeaderEnd As XYZ
	Get
	Set
public:
property XYZ^ LeaderEnd {
	XYZ^ get ();
	void set (XYZ^ value);
}
member LeaderEnd : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The point is located outside of the spatial element.
ArgumentNullException |  When setting this property: A non-optional argument was null
InvalidOperationException |  There is no leader for this tag. -or- When setting this property: SpatialElementTag is pinned. -or- When setting this property: SpatialElementTag is orphaned.
Remarks
 Returns the end point of the tag leader. Leader end point must be located inside of a room, space or an area. Use Room.IsPointInRoom or Space.IsPointInSpace method to check whether the leaderEnd is located in the host element or not.
See Also
Reference
SpatialElementTag Class
Autodesk.Revit.DB Namespace